/**
 * Java 网络编程
 *   指运行在多个设备的程序
 *    java.net 包中包含相应类和接口
 *   TCP
 *     传输控制协议
 *     面向连接+可靠+基于字节流的传输层通信协议
 *   UDP
 *     用户数据报协议
 *     无连接协议
 *     位于 OSI 模型的传输层
 * --------------------------------------------------
 * OSI 模型
 *   开放式系统互联通信参考模型(Open System Interconnection Reference Model)
 *   由国际标准化组织提出,一个试图使各种计算机在世界范围内互连为网络的标准框架,定义于 ISO/IEC 7498-1
 *   提供给开发者一个必须的通用的概念以便开发完善且可以用来解释连接不同系统的框架
 *   
 * --------------------------------------------------
 *     
 * 
 */
public class TCP1 {
    
}
